       identification division.
       program-id. manager.
       environment division.
       data division.
       file section.
       working-storage section.
       procedure division.
       stop run.